# # Using Google Big Query to retreive names from SSA

In [14]:
import os
import pandas as pd
from google.cloud.bigquery.client import Client
from pandas.io import sql
from config import password
import pymysql
from sqlalchemy import create_engine

Download credential JSON to access Google API

In [2]:
os.environ['GOOGLE_APPLICATION_CREDENTIALS'] ="Resources/ClassProject-5f5c7151accd.json"
bq_client = Client()

Create database reference, pointing at usa_names table and big query public data project

In [3]:
dataset_ref = bq_client.dataset('usa_names', project='bigquery-public-data')

In [4]:
type(dataset_ref)

google.cloud.bigquery.dataset.DatasetReference

In [5]:
dset = bq_client.get_dataset(dataset_ref)

In [6]:
type(dset)

google.cloud.bigquery.dataset.Dataset

In [7]:
hn_full = bq_client.get_table(dset.table("usa_1910_current"))

In [8]:
type(hn_full)

google.cloud.bigquery.table.Table

In [9]:
hn_full.schema

[SchemaField('state', 'STRING', 'NULLABLE', '2-digit state code', ()),
 SchemaField('gender', 'STRING', 'NULLABLE', 'Sex (M=male or F=female)', ()),
 SchemaField('year', 'INTEGER', 'NULLABLE', '4-digit year of birth', ()),
 SchemaField('name', 'STRING', 'NULLABLE', 'Given name of a person at birth', ()),
 SchemaField('number', 'INTEGER', 'NULLABLE', 'Number of occurrences of the name', ())]

Use SQL to query the full names dataset and retrive just those that are from New York and after the year 1999.  Then convert the results of that query to a Pandas data frame

In [10]:
sql = """
    SELECT year, name, SUM(number) as count
    FROM `bigquery-public-data.usa_names.usa_1910_current`
    WHERE state = 'NY' AND year > 1999
    GROUP BY 1,2
"""

df = bq_client.query(sql).to_dataframe()

In [11]:
df.head()

   year      name  count
0  2000    Maxine     25
1  2000    Makeda      6
2  2000    Devora     19
3  2000     Janai      8
4  2000  Geovanny      5

Output pandas dataframe to .csv for import into MySQL

In [12]:
df.to_csv("Output/ny_baby_names.csv", index=False, header=True)

..Or create connection to MySQL database, identify the schema and then create the table directly

In [13]:
engine = create_engine(f"mysql://root:{password}@localhost:3306/etl_project")
con = engine.connect()

df.to_sql(con=con, name='ny_baby_names', if_exists='replace')